app/Controllers/MikaController.php

SELECT *
FROM `menu`
---
	public function __construct()
	{
		helper(['mikaeilar_helper']);
		$this->t_empt = '0000-00-00';
		date_default_timezone_set("Asia/Jakarta");

		$this->layout 			= new Templates();
		$this->db 				= \Config\Database::connect();
		$this->session 			= \Config\Services::session();
		$this->form_validation 	= \Config\Services::validation();
		$this->uri 				= service('uri');
		$this->user_login 		= $this->session->get('user_login');
		$this->show404			= \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();

		$query = "SELECT TABLE_NAME FROM INFORMATION_SCHEMA.TABLES WHERE TABLE_TYPE = 'BASE TABLE' AND TABLE_SCHEMA='gammu'";
		$table = $this->db->query($query)->getResult();

		foreach ($table as $row) {
			$nm_tabel = $row->TABLE_NAME;
			$this->$nm_tabel = $this->db->table($nm_tabel);
		}

		$for_model 	= $this->menu->get()->getResult();

SELECT *
FROM `menu`
WHERE `link` = 'login'
 LIMIT 1
---

		$uri 		= $this->uri->getSegment(1);
		$this->menu->where('link', $uri);
		$menu 		= $this->menu->get(1)->getRow();